florin2520/TEF6686_STM32F411/Core/Src/RevEng_PAJ7620.c
/**
  \file RevEng_PAJ7620.cpp
  \author Aaron S. Crandall

  \version 1.5.0

  \copyright
  \parblock
  - Copyright (c) 2015 seeed technology inc.
  - Website    : www.seeed.cc
  - Author     : Wuruibin & Xiangnan
  - Modified Time: June 2015

  Additional contributions:
  - 2017 - Modified by MarcFinns to encapsulate in class without global variables  
  - 2020 - PROGMEM code adapted from Jaycar-Electronics' work  
  - 2020 - Modified by Aaron S. Crandall <crandall@gonzaga.edu>  
  - 2020 - Modified by Sean Kallaher (GitHub: skallaher) 
  
  Description: This driver class can recognize 9 gestures and output the result,
        including move up, move down, move left, move right,
        move forward, move backward, circle-clockwise,
        circle-anti (counter) clockwise, and wave.
        The driver also allows changing the sensor to 'cursor mode' where it
        tracks the closest object in view on an (X,Y) coordinate system.

  License: The MIT License (MIT)

  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:

  The above copyright notice and this permission notice shall be included in
  all copies or substantial portions of the Software.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
  THE SOFTWARE.
  \endparblock

  PAJ7620U2 Sensor data sheet for reference found here:
    https://datasheetspdf.com/pdf-file/1309990/PixArt/PAJ7620U2/1

  Driver sources, latest code, and authors available at:
    https://github.com/acrandal/RevEng_PAJ7620
*/

#include "I2C_reg.h"
#include "RevEng_PAJ7620.h"
#include "stm32f4xx_hal.h"

extern I2C_HandleTypeDef hi2c2;

/**
 * Initial device register addresses and values.
 * \note Puts device into gesture mode with various "normal" mode values.
 * \note Values taken from PixArt reference documentation v0.8 & v1.0 - see <a href="https://github.com/acrandal/RevEng_PAJ7620/wiki">wiki</a> for files
 */
#ifdef PROGMEM_COMPATIBLE
const unsigned short initRegisterArray[] PROGMEM = {
#else
const unsigned short initRegisterArray[] = {
#endif
    0xEF00,       // Bank 0
    0x4100,       // Disable interrupts for first 8 gestures
    0x4200,       // Disable wave (and other modes') interrupt(s)
    0x3707,
    0x3817,
    0x3906,
    0x4201,
    0x462D,
    0x470F,
    0x483C,
    0x4900,
    0x4A1E,
    0x4C22,
    0x5110,
    0x5E10,
    0x6027,
    0x8042,
    0x8144,
    0x8204,
    0x8B01,
    0x9006,
    0x950A,
    0x960C,
    0x9705,
    0x9A14,
    0x9C3F,
    0xA519,
    0xCC19,
    0xCD0B,
    0xCE13,
    0xCF64,
    0xD021,
    0xEF01,       // Bank 1
    0x020F,
    0x0310,
    0x0402,
    0x2501,
    0x2739,
    0x287F,
    0x2908,
    0x3EFF,
    0x5E3D,
    0x6596,       // R_IDLE_TIME LSB - Set sensor speed to 'normal speed' - 120 fps
    0x6797,
    0x69CD,
    0x6A01,
    0x6D2C,
    0x6E01,
    0x7201,
    0x7335,
    0x7400,       // Set to gesture mode
    0x7701,
    0xEF00,       // Bank 0
    0x41FF,       // Re-enable interrupts for first 8 gestures
    0x4201        // Re-enable interrupts for wave gesture
};


/** Generated size of the register set gesture mode array */
#define SET_GES_MODE_REG_ARRAY_SIZE (sizeof(setGestureModeRegisterArray)/sizeof(setGestureModeRegisterArray[0]))

/**
 * Gesture mode specific register addresses and values
 * \note Puts device into gesture mode with appropriate values.
 * \note Values taken from PixArt reference documentation v0.8 & v1.0 - see <a href="https://github.com/acrandal/RevEng_PAJ7620/wiki">wiki</a> for files
 */
#ifdef PROGMEM_COMPATIBLE
const unsigned short setGestureModeRegisterArray[] PROGMEM = {
#else
const unsigned short setGestureModeRegisterArray[] = {
#endif
    0xEF00,       // Bank 0
    0x4100,       // Disable interrupts for first 8 gestures
    0x4200,       // Disable wave (and other mode's) interrupt(s)
    0x483C,
    0x4900,
    0x5110,
    0x8320,
    0x9ff9,
    0xEF01,       // Bank 1
    0x011E,
    0x020F,
    0x0310,
    0x0402,
    0x4140,
    0x4330,
    0x6596,       // R_IDLE_TIME  - Normal mode LSB "120 fps" (supposedly)
    0x6600,
    0x6797,
    0x6801,
    0x69CD,
    0x6A01,
    0x6bb0,
    0x6c04,
    0x6D2C,
    0x6E01,
    0x7400,       // Set gesture mode
    0xEF00,       // Bank 0
    0x41FF,       // Re-enable interrupts for first 8 gestures
    0x4201        // Re-enable interrupts for wave gesture
};


/** Generated size of the register set cursor mode array */
#define SET_CURSOR_MODE_REG_ARRAY_SIZE (sizeof(setCursorModeRegisterArray)/sizeof(setCursorModeRegisterArray[0]))

/**
 * Cursor mode specific register addresses and values
 * \note Puts device into cursor mode with reasonable basic values.
 * \note Values taken from PixArt reference documentation v0.8 & v1.0 - see <a href="https://github.com/acrandal/RevEng_PAJ7620/wiki">wiki</a> for files
 */
#ifdef PROGMEM_COMPATIBLE
const unsigned short setCursorModeRegisterArray[] PROGMEM = {
#else
const unsigned short setCursorModeRegisterArray[] = {
#endif
    0xEF00,   // Set Bank 0
    0x3229,   // Default  29  [0] Cursor use top - def 1
              //              [1] Cursor Use BG Model - def 0
              //              [2] Cursor Invert Y - def 0       -- Not sure, doesn't seem to work
              //              [3] Cursor Invert X - def 1
              //              [5:4] Cursor top Ratio - def 0x2
    0x3301,   // Default  01  R_PositionFilterStartSizeTh [7:0]
    0x3400,   // Default  00  R_PositionFilterStartSizeTh [8]
    0x3501,   // Default  01  R_ProcessFilterStartSizeTh [7:0]
    0x3600,   // Default  00  R_ProcessFilterStartSizeTh [8]
    0x3703,   // Default  09  R_CursorClampLeft [4:0]
    0x381B,   // Default  15  R_CursorClampRight [4:0]
    0x3903,   // Default  0A  R_CursorClampUp [4:0]
    0x3A1B,   // Default  12  R_CursorClampDown [4:0]
    0x4100,   // Interrupt enable mask - Should be 00 (disable gestures)
              //              All gesture flags [7:0]
    0x4284,   // Interrupt enable mask - Should be 84 (0b 1000 0100)
              //              bit 0: Wave, wave mode use only
              //              bit 1: Proximity, proximity mode use only
              //              bit 2: Has Object, cursor mode use only
              //              bit 3: Wake up trigger, trigger mode use only
              //              bit 4: Confirm, confirm mode use only
              //              bit 5: Abort, confirm mode use only
              //              bit 6: N/A
              //              bit 7:No Object, cursor mode use only
    0x8B01,   // Default  10  R_Cursor_ObjectSizeTh [7:0]
    0x8C07,   // Default  07  R_PositionResolution [2:0]
    0xEF01,   // Set Bank 1
    0x0403,   // Invert X&Y Axes in lens for GUI coordinates
              //  Where (0,0) is in upper left, positive down (Y) and right (X)
    0x7403,   // Enable cursor mode 0 - gesture, 3 - cursor, 5 - proximity
    0xEF00    // Set Bank 0 (parking it)
};

