florin2520/TEF6686_STM32F411/Core/Src/RevEng_PAJ7620.c
    unsigned long gestureEntryTime; // User set gesture entry delay in ms (default: 0)
    unsigned long gestureExitTime;  // User set gesture exit delay in ms (default 200)


/**
 * PAJ7620 device initialization and I2C connect to default Wire bus
 * 
 * \param none
 * \return error code: 0 (false); success: return 1 (true)
 */
//uint8_t RevEng_PAJ7620::begin()
//{
//  return begin(&Wire);
//}


/**
 * PAJ7620 device initialization and I2C connect on specified Wire bus
 *
 * Override version:
 * \par
 * Takes a TwoWire pointer allowing the user to pass
 *    in a specified I2C bus for devices using alternatives to bus 0 such
 *    as: begin(&Wire1) or begin(&Wire2)
 *
 * \param chosenWireHandle A pointer to the Wire handle that should be
 *   used to communicate with the PAJ7620
 * \return error code: 0 (false); success: return 1 (true)
 */
//uint8_t begin(TwoWire *chosenWireHandle)
uint8_t beginPAJ7620()
{
  //print_serial2_message("DEBUG 1");
  // Reasonable timing delay values to make algorithm insensitive to
  //  hand entry and exit moves before and after detecting a gesture
  gestureEntryTime = 0;
  //gestureExitTime = 200;
  gestureExitTime = 200;
  //wireHandle = chosenWireHandle;      // Save selected I2C bus for our use

  //delayMicroseconds(700);	            // Wait 700us for PAJ7620U2 to stabilize
                                        // Reason: see v0.8 of 7620 documentation
  //wireHandle->begin();                // Start the I2C bus via wire library
  //HAL_Delay(1);
  uint32_t a;
  for (uint32_t i = 0; i < 500000; i++)
  {
    a = i;
    a++;
  }

  //print_serial2_message("DEBUG 2");
  /* There's two register banks (0 & 1) to be selected between.
   * BANK0 is where most data collection operations happen, so it's default.
   * Selecting the bank is done here twice for a reason. When the 7620 turns
   *  on, the I2C bus is sleeping. When you first read/write to the bus
   *  the 7620 wakes up, but it sometimes misses that first message.
   * Running the 7620 on an arduino with the USB power, a single call here
   *  usually works, but as soon as you use an external power bus it often
   *  fails to properly initialize and begin returns an error.
   */
  selectRegisterBank(BANK0);          // This is done twice on purpose
  selectRegisterBank(BANK0);          // Default operations on BANK0


//  if( !isPAJ7620UDevice() )
//  {
//    return 0;                         // Return false - wrong device found
//  }

  initializeDeviceSettings();         // Set registers up
  setGestureMode();                   // Specifically set to gesture mode

  return 1;
}


/**
 * Write memory register over I2C
 * \param i2cAddress register address
 * \param dataByte data (byte) to write
 * \return error code; success: return 0
 */
uint8_t writeRegister(uint8_t i2cAddress, uint8_t dataByte)
{
	  //uint32_t a;
//	  uint8_t buf[2];
//	  HAL_StatusTypeDef r;
//      buf[0] = dataByte;
//	  r = HAL_I2C_Master_Transmit(&hi2c2, (uint16_t)PAJ7620_I2C_BUS_ADDR, buf, 1, 1000);
//
////	   for (uint32_t i = 0; i < 5000; i++)
////	   {
////	     a = i;
////	     a++;
////	   }
//	  return (r == HAL_OK) ? 1 : 0;




  uint8_t resultCode = 0;
//  wireHandle->beginTransmission(PAJ7620_I2C_BUS_ADDR);   // start transmission
//  wireHandle->write(i2cAddress);                         // send register address
//  wireHandle->write(dataByte);                           // send value to write
//  resultCode = wireHandle->endTransmission();            // end transmission
  //print_serial2_message("DEBUG 3"); ///last ok
  I2C_2_Start ();
  I2C_2_Address (PAJ7620_I2C_BUS_ADDR); // todo
  I2C_2_Write (i2cAddress);
  I2C_2_Write (dataByte);
  I2C_2_Stop ();

  //print_serial2_message("DEBUG 4");
  return resultCode;
}

//todo
/**
 * Read memory register over I2C
 * \param i2cAddress : register address
 * \param byteCount : quantity of bytes to read into data
 * \param data : array of uint8_t to read data into
 * \return error code; success: return 0
 */
uint8_t readRegister(uint8_t i2cAddress, uint8_t byteCount, uint8_t data[])
{
  //uint8_t result_code;
//  wireHandle->beginTransmission(PAJ7620_I2C_BUS_ADDR);
//  wireHandle->write(i2cAddress);
//  result_code = wireHandle->endTransmission();
	I2C_2_Start ();
	I2C_2_Address (PAJ7620_I2C_BUS_ADDR);
	I2C_2_Write (i2cAddress);  // adresa registrului intern
	//I2C_3_Stop ();
	//I2C_3_Address (i2cAddress);
	I2C_2_Start ();  // start
	//I2C_3_Read (PAJ7620_I2C_BUS_ADDR+0x01, data, byteCount);
	I2C_2_Read (PAJ7620_I2C_READ_BUS_ADDR, data, byteCount);
	I2C_2_Stop ();
//	  uint32_t a;
//	  for (uint32_t i = 0; i < 10000; i++)
//	  {
//	    a = i;
//	    a++;
//	  }
//  if (result_code)            //return error code - if not zero
//    { return result_code; }

  //wireHandle->requestFrom((int)PAJ7620_I2C_BUS_ADDR, (int)byteCount);

//  while (wireHandle->available())
//  {
//    *data = wireHandle->read();
//    data++;
//  }

  return 0;
}


/**
 * Read the gestures interrupt vector #0 - all gestures except wave
 * \param data : &uint8_t for storing value read
 * \return error code; success: return 0
 */
uint8_t getGesturesReg0(uint8_t data[])
  { return readRegister(PAJ7620_ADDR_GES_RESULT_0, 1, data); }


/**
 * Read the gestures interrupt vector #1 - only holds wave
 * \param data : &uint8_t for storing value read
 * \return error code; success: return 0
 */
uint8_t getGesturesReg1(uint8_t data[])
  { return readRegister(PAJ7620_ADDR_GES_RESULT_1, 1, data); }


/**
 * Select memory bank to read/write to
 * \par
 * The PAJ7620 has two memory banks. The user must select which bank to use
 * when reading and writing over I2C.
 * \note This driver defaults to operations resetting to BANK0 for general operation.
 * \param bank : \link Bank_e \endlink to select (BANK0, BANK1)
 * \return none
 */
void selectRegisterBank(Bank_e bank)
{
  if( bank == BANK0 )
    { writeRegister(PAJ7620_REGISTER_BANK_SEL, PAJ7620_BANK0); }
  else if( bank == BANK1 )
    { writeRegister(PAJ7620_REGISTER_BANK_SEL, PAJ7620_BANK1); }
}


/**
 * Reads device memory to check for the PAJ7620 hardware identifier (ID)
 * \par
 * At memory address BANK0, 0x00 the device returns 0x20.
 * At memory address BANK0, 0x01 the device returns 0x76.
 * If this is not true, a non-PAJ7620 I2C device is attached at this I2C address.
 * See: PAJ7620U2 datasheet page 24 - 5.16 Chip/Version ID
 * \param none
 * \return bool: True means it is a PAJ7620, False means failure to read or ID match
 */
bool isPAJ7620UDevice()
{
  uint8_t data0 = 0, data1 = 0;

  // Device ID is stored in BANK0
  selectRegisterBank(BANK0);

  // Read PartID LSB[7:0] from Bank0, 0x00 - Should read 0x20
  // Read PartID MSB[15:8] from Bank0, 0x01 - Should read 0x76
  readRegister(PAJ7620_ADDR_PART_ID_0, 1, &data0);
  readRegister(PAJ7620_ADDR_PART_ID_1, 1, &data1);

  // Test if part ID is corect for PAJ7620U2
  //  See: PAJ7620U2 datasheet page 24 - 5.16 Chip/Version ID
  if ( (data0 != PAJ7620_PART_ID_LSB ) || (data1 != PAJ7620_PART_ID_MSB) )
    { return false; }

