florin2520/TEF6686_STM32F411/Core/Src/RevEng_PAJ7620.c
  return true;
}


/**
 * Writes an array of values to the device memory
 * 
 * \par
 * Writes over I2C to the memory banks a set of default values for operation.
 * The values are taken from the PAJ7620U2 v0.8 documentation and encoded
 * in the \link initRegisterArray \endlink from the driver's header file
 * 
 * \note Expects array[] to be stored in PROGMEM if it is available on your microcontroller
 * 
 * \param array : array of const unsigned shorts - first byte is address, second byte is data
 * \param arraySize : quantity of elements in array to write
 * \return none
 */
void writeRegisterArray(const unsigned short array[], int arraySize)
{
  for (unsigned int i = 0; i < arraySize; i++)
  {
    #ifdef PROGMEM_COMPATIBLE
      uint16_t word = pgm_read_word(&array[i]);
    #else
      uint16_t word = array[i];
    #endif

    uint8_t address, value;
    address = (word & 0xFF00) >> 8;
    value = (word & 0x00FF);
    writeRegister(address, value);
  }
  selectRegisterBank(BANK0);        // Guarantee parking in BANK0
}


/**
 * Initializes registers for device to default values
 * 
 * \par
 * Writes over I2C to the memory banks a set of default values for operation.
 * The values are taken from the PAJ7620U2 v0.8 documentation and encoded
 * in the \link initRegisterArray \endlink from the driver's header file
 * 
 * \param none
 * \return none
 */
void initializeDeviceSettings()
{
  writeRegisterArray(initRegisterArray, INIT_REG_ARRAY_SIZE);
}


/**
 * Puts device into Gesture mode
 * 
 * \par
 * Initializes registers for Gesture mode and enables only the gesture interrupts
 * 
 * \param none
 * \return none
 */
void setGestureMode()
{
  writeRegisterArray(setGestureModeRegisterArray, SET_GES_MODE_REG_ARRAY_SIZE);
}


/**
 * Puts device into Cursor mode
 * 
 * \par
 * Initializes registers for Cursor mode and enables only the cursor interrupts
 * 
 * \param none
 * \return none
 */
void setCursorMode()
{
  writeRegisterArray(setCursorModeRegisterArray, SET_CURSOR_MODE_REG_ARRAY_SIZE);
}


/**
 * Gets cursor object's current X location
 * 
 * \note Only works in cursor mode
 * \param none
 * \return int : X coordinate of cursor
 */
int getCursorX()
{
  int result = 0;
  uint8_t data0 = 0x00;
  uint8_t data1 = 0x00;

  readRegister(PAJ7620_ADDR_CURSOR_X_LOW, 1, &data0);
  readRegister(PAJ7620_ADDR_CURSOR_X_HIGH, 1, &data1);
  data1 &= 0x0F;      // Mask off high bits (unused)
  result |= data1;
  result = result << 8;
  result |= data0;

  return result;
}


/**
 * Gets cursor object's current Y location
 * 
 * \note Only works in cursor mode
 * \param none
 * \return int : Y coordinate of cursor
 */
int getCursorY()
{
  int result = 0;
  uint8_t data0 = 0x00;
  uint8_t data1 = 0x00;

  readRegister(PAJ7620_ADDR_CURSOR_Y_LOW, 1, &data0);
  readRegister(PAJ7620_ADDR_CURSOR_Y_HIGH, 1, &data1);
  data1 &= 0x0F;      // Mask off high bits (unused)
  result |= data1;
  result = result << 8;
  result |= data0;

  return result;
}


/**
 * Returns whether an object is in view as a cursor
 * 
 * \note Only works in cursor mode
 * \param none
 * \return bool : True if object in view, False if no object in view
 */
bool isCursorInView()
{
  bool result = false;
  uint8_t data = 0x00;
  readRegister(PAJ7620_ADDR_CURSOR_INT, 1, &data);
  switch(data)
  {
    case CUR_NO_OBJECT:   result = false;   break;
    case CUR_HAS_OBJECT:  result = true;    break;
    default:              result = false;   break;
  }
  return result;
}


/**
 * Inverts the X (horizontal) axis
 * 
 * \par
 * Allows you to choose the orientation of your coordinate system.
 * In all modes, the X axis is inverted. Left becomes Right, etc.
 * For cursor mode, the X values will flip
 * 
 * \param none
 * \return none
 */
void invertXAxis()
{
  uint8_t data = 0x00;
  selectRegisterBank(BANK1);
  readRegister(PAJ7620_ADDR_LENS_ORIENTATION, 1, &data);
  data ^= 1UL << 0;               // Bit[0] controls X axis
  writeRegister(PAJ7620_ADDR_LENS_ORIENTATION, data);
  selectRegisterBank(BANK0);
}


/**
 * Inverts the Y (vertical) axis
 * 
 * \par
 * Allows you to choose the orientation of your coordinate system.
 * In all modes, the Y axis is inverted. Up becomes Down, etc.
 * For cursor mode, the Y values will flip
 * 
 * \param none
 * \return none
 */
void invertYAxis()
{
  uint8_t data = 0x00;
  selectRegisterBank(BANK1);
  readRegister(PAJ7620_ADDR_LENS_ORIENTATION, 1, &data);
  data ^= 1UL << 1;                 // Bit[1] controls Y axis
  writeRegister(PAJ7620_ADDR_LENS_ORIENTATION, data);
  selectRegisterBank(BANK0);
}


/**
 * Disables sensor for reading & interrupts
 * \note This is the light disable state, not the full I2C shutdown state
 * \param none
 * \return none
 */
void disablePAJsensor()
{
  selectRegisterBank(BANK1);
  writeRegister(PAJ7620_ADDR_OPERATION_ENABLE, PAJ7620_DISABLE);
  selectRegisterBank(BANK0);
}


/**
 * Enables sensor for reading & interrupts
 * 
 *  \param none
 *  \return none
 */
void enablePAJsensor()
{
  selectRegisterBank(BANK1);
  writeRegister(PAJ7620_ADDR_OPERATION_ENABLE, PAJ7620_ENABLE);
  selectRegisterBank(BANK0);
}

/**
 * Sets time sensor waits between getGesture call to reading gesture from sensor
 * \par
 *  This time is most important in hardware interrupt driven use of the driver.
 *  The PAJ7620's interrupt pin will raise when a gesture is first recognized.
 *  If the user is trying to move their hand to do a Backward gesture, they will
 *  first trip a lateral (up, down, left, right) gesture, which will immediately
 *  raise the interrupt.
 *  By increasing this value, the user shall have more time to reach in and complete
 *  their intended gesture before the interrupt is handled.
 * \note Default value for entry time is 0
 * \param newGestureEntryTime : milliseconds (ms) for delay
 * \return none
 */
void setGestureEntryTime(unsigned long newGestureEntryTime)
{
  gestureEntryTime = newGestureEntryTime;
}


/**
 * Sets time sensor waits during getGesture() after gesture value read
 * \par
 *  This value represents the time the user has to exit the sensor's field of view
 *  before the next gesture might be read, which is most important in the Z axis gestures
 *  (forward and backward).
 *  Setting this lower makes the driver delay less so the main program can control
 *  more of the global timing, but puts responsibility on the coder to take this higher
 *  sensitivity into account.
 * \note Default value for exit time is 200
 * \param newGestureEntryTime : milliseconds (ms) for delay
 * \return none
 */
void setGestureExitTime(unsigned long newGestureExitTime)
{
  gestureExitTime = newGestureExitTime;
}


/**
 * Set sensor to "game mode" sampling speed of 240fps
 * \note Value of 0x30 for setting comes from PixArt contact
 *
 * \param none
 * \return none
 */
void setGameSpeed()
{
  selectRegisterBank(BANK1);
  writeRegister(PAJ7620_ADDR_R_IDLE_TIME_0, PAJ7620_GAME_SPEED);
  selectRegisterBank(BANK0);
}


/**
 * Set sensor to "normal" sampling speed of 120fps
 * \note Value of 0xAC for setting comes from PixArt contact
 *
 * \param none
 * \return none
 */
void setNormalSpeed()
{
  selectRegisterBank(BANK1);
  writeRegister(PAJ7620_ADDR_R_IDLE_TIME_0, PAJ7620_NORMAL_SPEED);
  selectRegisterBank(BANK0);
}


/**
 * Clear current gesture interrupt vectors without returning gesture value
 * \note The gesture interrupt vectors are reset in hardware after any reads
 *
 * \param none
 * \return none
 */
void clearGestureInterrupts()
{
    uint8_t data = 0, data1 = 0;
    getGesturesReg0(&data);
    getGesturesReg1(&data1);
}


/**
 * Get current count of waves by user
 * \param none
 * \return int : current count of "waves" over the sensor
 */
int getWaveCount()
{
  uint8_t waveCount = 0;
  readRegister(PAJ7620_ADDR_WAVE_COUNT, 1, &waveCount);
  waveCount &= 0x0F;      // Count is [3:0] bits - values in 0..15
  return waveCount;
}


/**
 * Double check to see if user is executing a Z-axis gesture 
 * 
 * \par
 *  This is there the gestureEntryTime and gestureExitTime delays are executed
 *  to buffer high speed polling & return against human gesture speeds.
 * \param initialGesture : The gesture initially found when getGesture() was called
 * \return \link Gesture \endlink : Either the initialGesture or the updated one if the user does another one
 */
Gesture forwardBackwardGestureCheck(Gesture initialGesture)
{
  uint8_t data1 = 0;
  Gesture result = initialGesture;

  //delay(gestureEntryTime);
  HAL_Delay(gestureEntryTime);
  getGesturesReg0(&data1);
  if (data1 == GES_FORWARD_FLAG)
  {
    //delay(gestureExitTime);
	HAL_Delay(gestureExitTime);
    result = GES_FORWARD;
  }
  else if (data1 == GES_BACKWARD_FLAG)
  {
    //delay(gestureExitTime);
	HAL_Delay(gestureExitTime);
    result = GES_BACKWARD;
  }
  return result;
}


/**
 * Reads the latest gesture from the device
 * 
 * \par
 *  This is the central method for reading and calculating the main 9 gestures
 *  the PAJ7620 can recognize. It returns a Gesture enum with the read gesture,
 *  which can by GES_NONE if no gesture was currently found.
 * \note Clears interrupt vector of gestures when called
 * \param none
 * \return \link Gesture \endlink found or \link GES_NONE Gesture::GES_NONE \endlink if no gesture found
 */
Gesture readGesture()
{
  uint8_t data = 0, data1 = 0, readCode = 0;
  Gesture result = GES_NONE;

  readCode = getGesturesReg0(&data);
  if (readCode)
  {
    return GES_NONE;
  }
  else
  {
    switch (data)
    {
      case GES_RIGHT_FLAG:
        result = forwardBackwardGestureCheck(GES_RIGHT);
        break;

      case GES_LEFT_FLAG:
        result = forwardBackwardGestureCheck(GES_LEFT);
        break;

      case GES_UP_FLAG:
        result = forwardBackwardGestureCheck(GES_UP);
        break;

      case GES_DOWN_FLAG:
        result = forwardBackwardGestureCheck(GES_DOWN);
        break;

      case GES_FORWARD_FLAG:
        //delay(gestureExitTime);
        HAL_Delay(gestureExitTime);
        result = GES_FORWARD;
        break;

