florin2520/TEF6686_STM32F411/Core/Src/RevEng_PAJ7620.c
      case GES_BACKWARD_FLAG:
        //delay(gestureExitTime);
    	HAL_Delay(gestureExitTime);
        result = GES_BACKWARD;
        break;

      case GES_CLOCKWISE_FLAG:
        result = GES_CLOCKWISE;
        break;

      case GES_ANTI_CLOCKWISE_FLAG:
        result = GES_ANTICLOCKWISE;
        break;

      default:
        getGesturesReg1(&data1);      // Bank 1 (Reg 0x44) has wave flag
        if (data1 == GES_WAVE_FLAG)
          { result = GES_WAVE; }
        break;
    }
  }
  return result;
}


/**
 * Read object's "brightness"
 * 
 * \par
 * Objects in view have their IR reflection measured. This interface returns a
 *  measure of this brightness from 0..255
 * \return int brightness: brightness value 0..255
 */
int getObjectBrightness()
{
  uint8_t brightness = 0x00;
  readRegister(PAJ7620_ADDR_OBJECT_BRIGHTNESS, 1, &brightness);
  return brightness;
}


/**
 * Read object's size (in pixels)
 * 
 * \par
 * The sensor has a 30x30 IR LED array. This interface returns a count of
 *  how many pixels are part of the object in view being tracked.
 * \return int size: value 0..900
 */
int getObjectSize()
{
  uint8_t data0, data1 = 0x00;
  int result = 0;
  readRegister(PAJ7620_ADDR_OBJECT_SIZE_LSB, 1, &data0);
  readRegister(PAJ7620_ADDR_OBJECT_SIZE_MSB, 1, &data1);
  result = data1;
  result = result << 8;
  result |= data0;
  return result;
}


/**
 * Get how long since the object left the view in gesture mode
 * 
 * \par
 * When an object has left the sensor's view, this register starts counting up.
 *  It's counting in ticks, roughly one per 7.2ms. It maxes out at 255, which
 *  happens at about 1830ms
 * \return int : ticks value 0..255
 */
int getNoObjectCount()
{
  uint8_t data0 = 0x00;
  readRegister(PAJ7620_ADDR_NO_OBJECT_COUNT, 1, &data0);
  return (int)data0;
}


/**
 * Get how long no motion has been seen in gesture mode
 * 
 * \par
 * This counts how long it has been since motions has occurred in front of the sensor.
 * This counts even if there's an object in view when it isn't moving.
 * Eratta: This *should* return 0..255, but seems to stop at 12.
 * Each "count" is probably 7.2ms, but it's been tough to figure out.
 * \return int : ticks value 0..12
 */
int getNoMotionCount()
{
  uint8_t data0 = 0x00;
  readRegister(PAJ7620_ADDR_NO_MOTION_COUNT, 1, &data0);
  return (int)data0;
}


/**
 * Gets Gesture object's current X location
 * 
 * \note Only works in gesture mode - default coordinates are 0 on right
 * \note Range seems to be 0..3712 in default gesture mode
 * \param none
 * \return int : X coordinate of cursor
 */
int getObjectCenterX()
{
  int result = 0;
  uint8_t data0 = 0x00;
  uint8_t data1 = 0x00;

  readRegister(PAJ7620_ADDR_OBJECT_CENTER_X_LSB, 1, &data0);
  readRegister(PAJ7620_ADDR_OBJECT_CENTER_X_MSB, 1, &data1);
  data1 &= 0x1F;      // Mask off high bits (unused)
  result |= data1;
  result = result << 8;
  result |= data0;

  return result;
}


/**
 * Gets Gesture object's current Y location
 * 
 * \note Only works in gesture mode - default coordinates are 0 on top
 * \note Range seems to be 0..3712 in default gesture mode
 * \param none
 * \return int : Y coordinate of cursor
 */
int getObjectCenterY()
{
  int result = 0;
  uint8_t data0 = 0x00;
  uint8_t data1 = 0x00;

  readRegister(PAJ7620_ADDR_OBJECT_CENTER_Y_LSB, 1, &data0);
  readRegister(PAJ7620_ADDR_OBJECT_CENTER_Y_MSB, 1, &data1);
  data1 &= 0x1F;      // Mask off high bits (unused)
  result |= data1;
  result = result << 8;
  result |= data0;

  return result;
}


/**
 * Gets object's current X velocity's raw value
 * 
 * \note Range seems to be -63..63
 * \param none
 * \return int : X velocity -63..63
 */
int getObjectVelocityX_raw()
{
  int result = 0;
  uint8_t data0 = 0x00;
  uint8_t data1 = 0x00;

  readRegister(PAJ7620_ADDR_OBJECT_VEL_X_LSB, 1, &data0);
  readRegister(PAJ7620_ADDR_OBJECT_VEL_X_MSB, 1, &data1);

  data0 &= 0x3F;        // Yup, see wiki for reason
  result = data0;
  if(data1) { result *= -1; }

  return result;
}


/**
 * Gets object's current Y velocity's raw value
 * 
 * \note Range seems to be -63..63
 * \param none
 * \return int : Y velocity -63..63
 */
int getObjectVelocityY_raw()
{
  int result = 0;
  uint8_t data0 = 0x00;
  uint8_t data1 = 0x00;

  readRegister(PAJ7620_ADDR_OBJECT_VEL_Y_LSB, 1, &data0);
  readRegister(PAJ7620_ADDR_OBJECT_VEL_Y_MSB, 1, &data1);
  data0 &= 0x3F;        // Yup, see wiki for reason
  result = data0;
  if(data1) { result *= -1; }

  return result;
}


/**
 * Gets object's current X velocity's value
 * 
 * \par
 * Value filtered to zero if object not in view
 * \note Range seems to be -63..63
 * \param none
 * \return int : X velocity -63..63
 */
int getObjectVelocityX()
{
  if(!isObjectInView()) {
    return 0;
  } else {
    return getObjectVelocityX_raw();
  }
}


/**
 * Gets object's current Y velocity's value
 * 
 * \par
 * Value filtered to zero if object not in view
 * \note Range seems to be -63..63
 * \param none
 * \return int : Y velocity -63..63
 */
int getObjectVelocityY()
{
  if(!isObjectInView()) {
    return 0;
  } else {
    return getObjectVelocityY_raw();
  }
}


/**
 * Gets whether an object is in view or not
 * 
 * \param none
 * \return bool : true if object in view
 */
bool isObjectInView()
{
  if(getNoObjectCount())
  {
    return false;
  }
  return true;
}


/**
 * Gets which quadrant an object is in
 * 
 * \param none
 * \return Corner : [NW, NW, SW, SE] quadrants, middle/buffer, NONE for no object in view
 */
Corner getCorner()
{
  Corner ret = CORNER_NONE;
  int object_x, object_y = 0;

  if( !isObjectInView() ) {   // Bail if no object in view
    return CORNER_NONE;
  }

  object_x = getObjectCenterX();
  object_y = getObjectCenterY();

  if( object_x < CORNERS_BUFFER_LOWER && object_y < CORNERS_BUFFER_LOWER ) {
    return CORNER_NE;
  }
  else if( object_x > CORNERS_BUFFER_UPPER && object_y < CORNERS_BUFFER_LOWER ) {
    return CORNER_NW;
  }
  else if( object_x > CORNERS_BUFFER_UPPER && object_y > CORNERS_BUFFER_UPPER ) {
    return CORNER_SW;
  }
  else if( object_x < CORNERS_BUFFER_LOWER && object_y > CORNERS_BUFFER_UPPER ) {
    return CORNER_SE;
  }
  else {
    return CORNER_MIDDLE;     // Is in view, but not fully in a corner yet
  }
}


